apache/nuttx/arch/arm/src/at32/hardware/at32f43xxx_rcc.h
/****************************************************************************
 * arch/arm/src/at32/hardware/at32f43xxx_rcc.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_AT32_HARDWARE_AT32F43XXX_RCC_H
#define __ARCH_ARM_SRC_AT32_HARDWARE_AT32F43XXX_RCC_H

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define AT32_CRM_CTRL_OFFSET            0x000 /* Clock control register */
#define AT32_CRM_PLL_CFG_OFFSET         0x004 /* PLL configuration register */
#define AT32_CRM_CFG_OFFSET             0x008 /* Clock configuration register */
#define AT32_CRM_CLKINT_OFFSET          0x00C /* Clock interrupt register */
#define AT32_CRM_AHBRST1_OFFSET         0x010 /* AHB1 peripheral reset register */
#define AT32_CRM_AHBRST2_OFFSET         0x014 /* AHB2 peripheral reset register */
#define AT32_CRM_AHBRST3_OFFSET         0x018 /* AHB3 peripheral reset register */
#define AT32_CRM_APB1RST_OFFSET         0x020 /* APB1 Peripheral reset register */
#define AT32_CRM_APB2RST_OFFSET         0x024 /* APB2 Peripheral reset register */
#define AT32_CRM_AHBEN1_OFFSET          0x030 /* AHB1 Peripheral Clock enable register */
#define AT32_CRM_AHBEN2_OFFSET          0x034 /* AHB2 Peripheral Clock enable register */
#define AT32_CRM_AHBEN3_OFFSET          0x038 /* AHB3 Peripheral Clock enable register */
#define AT32_CRM_APB1EN_OFFSET          0x040 /* APB1 Peripheral Clock enable register */
#define AT32_CRM_APB2EN_OFFSET          0x044 /* APB2 Peripheral Clock enable register */
#define AT32_CRM_AHBLPEN1_OFFSET        0x050 /* RCC AHB1 low power mode peripheral clock enable register */
#define AT32_CRM_AHBLPEN2_OFFSET        0x054 /* RCC AHB2 low power mode peripheral clock enable register */
#define AT32_CRM_AHBLPEN3_OFFSET        0x058 /* RCC AHB3 low power mode peripheral clock enable register */
#define AT32_CRM_APB1LPEN_OFFSET        0x060 /* RCC APB1 low power mode peripheral clock enable register */
#define AT32_CRM_APB2LPEN_OFFSET        0x064 /* RCC APB2 low power mode peripheral clock enable register */
#define AT32_CRM_BPDC_OFFSET            0x070 /* Backup domain control register */
#define AT32_CRM_CTRLSTS_OFFSET         0x074 /* Control/status register */
#define AT32_CRM_MISC1_OFFSET           0x0A0 /* Misc1 register */
#define AT32_CRM_MISC2_OFFSET           0x0A4 /* Misc2 register */

/* Register Addresses *******************************************************/

#define AT32_CRM_CTRL                   (AT32_CRM_BASE+AT32_CRM_CTRL_OFFSET)       
#define AT32_CRM_PLL_CFG                (AT32_CRM_BASE+AT32_CRM_PLL_CFG_OFFSET)   
#define AT32_CRM_CFG                    (AT32_CRM_BASE+AT32_CRM_CFG_OFFSET)   
#define AT32_CRM_CLKINT                 (AT32_CRM_BASE+AT32_CRM_CLKINT_OFFSET)   
#define AT32_CRM_AHBRST1                (AT32_CRM_BASE+AT32_CRM_AHBRST1_OFFSET)   
#define AT32_CRM_AHBRST2                (AT32_CRM_BASE+AT32_CRM_AHBRST2_OFFSET)   
#define AT32_CRM_AHBRST3                (AT32_CRM_BASE+AT32_CRM_AHBRST3_OFFSET)   
#define AT32_CRM_APB1RST                (AT32_CRM_BASE+AT32_CRM_APB1RST_OFFSET)   
#define AT32_CRM_APB2RST                (AT32_CRM_BASE+AT32_CRM_APB2RST_OFFSET)   
#define AT32_CRM_AHBEN1                 (AT32_CRM_BASE+AT32_CRM_AHBEN1_OFFSET)   
#define AT32_CRM_AHBEN2                 (AT32_CRM_BASE+AT32_CRM_AHBEN2_OFFSET)   
#define AT32_CRM_AHBEN3                 (AT32_CRM_BASE+AT32_CRM_AHBEN3_OFFSET)   
#define AT32_CRM_APB1EN                 (AT32_CRM_BASE+AT32_CRM_APB1EN_OFFSET)   
#define AT32_CRM_APB2EN                 (AT32_CRM_BASE+AT32_CRM_APB2EN_OFFSET)   
#define AT32_CRM_AHBLPEN1               (AT32_CRM_BASE+AT32_CRM_AHBLPEN1_OFFSET)   
#define AT32_CRM_AHBLPEN2               (AT32_CRM_BASE+AT32_CRM_AHBLPEN2_OFFSET)   
#define AT32_CRM_AHBLPEN3               (AT32_CRM_BASE+AT32_CRM_AHBLPEN3_OFFSET)   
#define AT32_CRM_APB1LPEN               (AT32_CRM_BASE+AT32_CRM_APB1LPEN_OFFSET)   
#define AT32_CRM_APB2LPEN               (AT32_CRM_BASE+AT32_CRM_APB2LPEN_OFFSET)   
#define AT32_CRM_BPDC                   (AT32_CRM_BASE+AT32_CRM_BPDC_OFFSET)   
#define AT32_CRM_CTRLSTS                (AT32_CRM_BASE+AT32_CRM_CTRLSTS_OFFSET)   
#define AT32_CRM_MISC1                  (AT32_CRM_BASE+AT32_CRM_MISC1_OFFSET)   
#define AT32_CRM_MISC2                  (AT32_CRM_BASE+AT32_CRM_MISC2_OFFSET)   

/* Register Bitfield Definitions ********************************************/

/* Clock control register */

#define CRM_CTRL_HICKEN                 (1 << 0)    /* High speed internal clock enable */
#define CRM_CTRL_HICKSTBL               (1 << 1)    /* High speed internal clock stable */
#define CRM_CTRL_HICKTRIM               (0x3F << 2) /* High speed internal clock trimming */
#define CRM_CTRL_HICKCAL                (0xFF << 8) /* High speed internal clock calibration */
#define CRM_CTRL_HEXTEN                 (1 << 16)   /* High speed external crystal enable */
#define CRM_CTRL_HEXTSTBL               (1 << 17)   /* High speed external crystal stable */
#define CRM_CTRL_HEXTBYPS               (1 << 18)   /* High speed external crystal bypass */
#define CRM_CTRL_CFDEN                  (1 << 19)   /* Clock Failure Detection enable */
#define CRM_CTRL_PLLEN                  (1 << 24)   /* PLL enable */
#define CRM_CTRL_PLLSTBL                (1 << 25)   /* PLL clock stable */

/* PLL configuration register */

#define CRM_PLL_CFG_PLL_MS_SHIFT        (0) /* PLL pre-division, range: 1~15 */
#define CRM_PLL_CFG_PLL_MS_MASK         (15 << CRM_PLL_CFG_PLL_MS_SHIFT) 
#  define CRM_PLL_CFG_PLL_MS(n)         ((n) << CRM_PLL_CFG_PLL_MS_SHIFT) /* n = 1..15 */

#define CRM_PLL_CFG_PLL_NS_SHIFT        (6) /* PLL Multiplication Factor,range: 31~500 */
#define CRM_PLL_CFG_PLL_NS_MASK         (0x1FF << CRM_PLL_CFG_PLL_NS_SHIFT) 
#  define CRM_PLL_CFG_PLL_NS(n)         ((n) << CRM_PLL_CFG_PLL_NS_SHIFT) /* n = 31..500 */

#define CRM_PLL_CFG_PLL_FR_SHIFT        (16) /* PLL post-division */   
#define CRM_PLL_CFG_PLL_FR_MASK         (7 << CRM_PLL_CFG_PLL_FR_SHIFT)
#  define CRM_PLL_CFG_PLL_FR_1          (0 << CRM_PLL_CFG_PLL_FR_SHIFT) /* div 1 */
#  define CRM_PLL_CFG_PLL_FR_2          (1 << CRM_PLL_CFG_PLL_FR_SHIFT) /* div 2 */
#  define CRM_PLL_CFG_PLL_FR_4          (2 << CRM_PLL_CFG_PLL_FR_SHIFT) /* div 4 */
#  define CRM_PLL_CFG_PLL_FR_8          (3 << CRM_PLL_CFG_PLL_FR_SHIFT) /* div 8 */
#  define CRM_PLL_CFG_PLL_FR_16         (4 << CRM_PLL_CFG_PLL_FR_SHIFT) /* div 16 */
#  define CRM_PLL_CFG_PLL_FR_32         (5 << CRM_PLL_CFG_PLL_FR_SHIFT) /* div 32 */

#define CRM_PLL_CFG_PLLRCS              (1 << 22) /* PLL reference clock select */

/* Clock configuration register */

