apache/nuttx/arch/arm/src/at32/hardware/at32f43xxx_rcc.h
#define CRM_CFG_SCLKSEL_SHIFT           (0) /* System clock select */
#define CRM_CFG_SCLKSEL_MASK            (3 << CRM_CFG_SCLKSEL_SHIFT)
#  define CRM_CFG_SEL_HICK              (0 << CRM_CFG_SCLKSEL_SHIFT) /* Select HICK */
#  define CRM_CFG_SEL_HEXT              (1 << CRM_CFG_SCLKSEL_SHIFT) /* Select HEXT */
#  define CRM_CFG_SEL_PLL               (2 << CRM_CFG_SCLKSEL_SHIFT) /* Select PLL */

#define CRM_CFG_SCLKSTS_SHIFT           (2) /* System clock select status */
#define CRM_CFG_SCLKSTSL_MASK           (3 << CRM_CFG_SCLKSTS_SHIFT)
#  define CRM_CFG_STS_HICK              (0 << CRM_CFG_SCLKSTS_SHIFT) /* Select HICK */
#  define CRM_CFG_STS_HEXT              (1 << CRM_CFG_SCLKSTS_SHIFT) /* Select HEXT */
#  define CRM_CFG_STS_PLL               (2 << CRM_CFG_SCLKSTS_SHIFT) /* Select PLL */

#define CRM_CFG_AHBDIV_SHIFT            (4) /* AHB division */
#define CRM_CFG_AHBDIV_MASK             (7 << CRM_CFG_AHBDIV_SHIFT)
#  define CRM_CFG_AHBDIV_NONE           (0 << CRM_CFG_AHBDIV_SHIFT)  /* AHB division None */
#  define CRM_CFG_AHBDIV_2              (8 << CRM_CFG_AHBDIV_SHIFT)  /* AHB division 2 */
#  define CRM_CFG_AHBDIV_4              (9 << CRM_CFG_AHBDIV_SHIFT)  /* AHB division 4 */
#  define CRM_CFG_AHBDIV_8              (10 << CRM_CFG_AHBDIV_SHIFT) /* AHB division 8 */
#  define CRM_CFG_AHBDIV_16             (11 << CRM_CFG_AHBDIV_SHIFT) /* AHB division 16 */
#  define CRM_CFG_AHBDIV_64             (12 << CRM_CFG_AHBDIV_SHIFT) /* AHB division 64 */
#  define CRM_CFG_AHBDIV_128            (13 << CRM_CFG_AHBDIV_SHIFT) /* AHB division 128 */
#  define CRM_CFG_AHBDIV_256            (14 << CRM_CFG_AHBDIV_SHIFT) /* AHB division 256 */
#  define CRM_CFG_AHBDIV_512            (15 << CRM_CFG_AHBDIV_SHIFT) /* AHB division 512 */

#define CRM_CFG_APB1DIV_SHIFT           (10) /* APB1 division */
#define CRM_CFG_APB1DIV_MASK            (7 << CRM_CFG_APB1DIV_SHIFT)
#  define CRM_CFG_APB1DIV_NONE          (3 << CRM_CFG_APB1DIV_SHIFT) /* APB1 division None */
#  define CRM_CFG_APB1DIV_2             (4 << CRM_CFG_APB1DIV_SHIFT) /* APB1 division 2 */
#  define CRM_CFG_APB1DIV_4             (5 << CRM_CFG_APB1DIV_SHIFT) /* APB1 division 4 */
#  define CRM_CFG_APB1DIV_8             (6 << CRM_CFG_APB1DIV_SHIFT) /* APB1 division 8 */
#  define CRM_CFG_APB1DIV_16            (7 << CRM_CFG_APB1DIV_SHIFT) /* APB1 division 16 */

#define CRM_CFG_APB2DIV_SHIFT           (13) /* APB2 division */
#define CRM_CFG_APB2DIV_MASK            (7 << CRM_CFG_APB2DIV_SHIFT)
#  define CRM_CFG_APB2DIV_NONE          (3 << CRM_CFG_APB2DIV_SHIFT) /* APB2 division None */
#  define CRM_CFG_APB2DIV_2             (4 << CRM_CFG_APB2DIV_SHIFT) /* APB2 division 2 */
#  define CRM_CFG_APB2DIV_4             (5 << CRM_CFG_APB2DIV_SHIFT) /* APB2 division 4 */
#  define CRM_CFG_APB2DIV_8             (6 << CRM_CFG_APB2DIV_SHIFT) /* APB2 division 8 */
#  define CRM_CFG_APB2DIV_16            (7 << CRM_CFG_APB2DIV_SHIFT) /* APB2 division 16 */

#define CRM_CFG_ERTCDIV_SHIFT           (16) /* HEXT division for ERTC clock */
#define CRM_CFG_ERTCDIV_MASK            (31 << CRM_CFG_ERTCDIV_SHIFT)
#  define CRM_CFG_ERTCDIV_NONE1         (0 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock None */
#  define CRM_CFG_ERTCDIV_NONE2         (1 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock None */
#  define CRM_CFG_ERTCDIV_2             (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 2 */
#  define CRM_CFG_ERTCDIV_3             (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 3 */
#  define CRM_CFG_ERTCDIV_4             (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 4 */
#  define CRM_CFG_ERTCDIV_5             (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 5 */
#  define CRM_CFG_ERTCDIV_6             (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 6 */
#  define CRM_CFG_ERTCDIV_7             (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 7 */
#  define CRM_CFG_ERTCDIV_8             (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 8 */
#  define CRM_CFG_ERTCDIV_9             (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 9 */
#  define CRM_CFG_ERTCDIV_10            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 10 */
#  define CRM_CFG_ERTCDIV_11            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 11 */
#  define CRM_CFG_ERTCDIV_12            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 12 */
#  define CRM_CFG_ERTCDIV_13            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 13 */
#  define CRM_CFG_ERTCDIV_14            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 14 */
#  define CRM_CFG_ERTCDIV_15            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 15 */
#  define CRM_CFG_ERTCDIV_16            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 16 */
#  define CRM_CFG_ERTCDIV_17            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 17 */
#  define CRM_CFG_ERTCDIV_18            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 18 */
#  define CRM_CFG_ERTCDIV_19            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 19 */
#  define CRM_CFG_ERTCDIV_20            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 20 */
#  define CRM_CFG_ERTCDIV_21            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 21 */
#  define CRM_CFG_ERTCDIV_22            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 22 */
#  define CRM_CFG_ERTCDIV_23            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 23 */
#  define CRM_CFG_ERTCDIV_24            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 24 */
#  define CRM_CFG_ERTCDIV_25            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 25 */
#  define CRM_CFG_ERTCDIV_26            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 26 */
#  define CRM_CFG_ERTCDIV_27            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 27 */
#  define CRM_CFG_ERTCDIV_28            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 28 */
#  define CRM_CFG_ERTCDIV_29            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 29 */
#  define CRM_CFG_ERTCDIV_30            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 30 */
#  define CRM_CFG_ERTCDIV_31            (2 << CRM_CFG_ERTCDIV_SHIFT) /* HEXT division for ERTC clock 31 */

#define CRM_CFG_CLKOUT1_SEL_SHIFT           (21) /* Clock output1 selection */
#define CRM_CFG_CLKOUT1_SEL_MASK            (3 << CRM_CFG_APB1DIV_SHIFT)
#  define CRM_CFG_CLKOUT1_SEL_HICK          (0 << CRM_CFG_APB1DIV_SHIFT) /* HICK output */
#  define CRM_CFG_CLKOUT1_SEL_LEXT          (1 << CRM_CFG_APB1DIV_SHIFT) /* LEXT output */
#  define CRM_CFG_CLKOUT1_SEL_HEXT          (2 << CRM_CFG_APB1DIV_SHIFT) /* HEXT output */
#  define CRM_CFG_CLKOUT1_SEL_PLL           (3 << CRM_CFG_APB1DIV_SHIFT) /* PLL output */

