apache/nuttx/arch/arm/src/at32/hardware/at32f43xxx_rcc.h
#define CRM_CFG_CLKOUT1DIV1_SHIFT           (24) /* Clock output1 division1 */
#define CRM_CFG_CLKOUT1DIV1_MASK            (7 << CRM_CFG_CLKOUT1DIV1_SHIFT)
#  define CRM_CFG_CLKOUT1DIV1_1             (3 << CRM_CFG_CLKOUT1DIV1_SHIFT) /* CLKOUT1 */
#  define CRM_CFG_CLKOUT1DIV1_1_2           (4 << CRM_CFG_CLKOUT1DIV1_SHIFT) /* CLKOUT1/2 */
#  define CRM_CFG_CLKOUT1DIV1_1_3           (5 << CRM_CFG_CLKOUT1DIV1_SHIFT) /* CLKOUT1/3 */
#  define CRM_CFG_CLKOUT1DIV1_1_4           (6 << CRM_CFG_CLKOUT1DIV1_SHIFT) /* CLKOUT1/4 */
#  define CRM_CFG_CLKOUT1DIV1_1_5           (7 << CRM_CFG_CLKOUT1DIV1_SHIFT) /* CLKOUT1/5 */

#define CRM_CFG_CLKOUT2DIV1_SHIFT           (27) /* Clock output2 division1 */
#define CRM_CFG_CLKOUT2DIV1_MASK            (7 << CRM_CFG_CLKOUT2DIV1_SHIFT)
#  define CRM_CFG_CLKOUT2DIV1_1             (3 << CRM_CFG_CLKOUT2DIV1_SHIFT) /* CLKOUT2 */
#  define CRM_CFG_CLKOUT2DIV1_1_2           (4 << CRM_CFG_CLKOUT2DIV1_SHIFT) /* CLKOUT2/2 */
#  define CRM_CFG_CLKOUT2DIV1_1_3           (5 << CRM_CFG_CLKOUT2DIV1_SHIFT) /* CLKOUT2/3 */
#  define CRM_CFG_CLKOUT2DIV1_1_4           (6 << CRM_CFG_CLKOUT2DIV1_SHIFT) /* CLKOUT2/4 */
#  define CRM_CFG_CLKOUT2DIV1_1_5           (7 << CRM_CFG_CLKOUT2DIV1_SHIFT) /* CLKOUT2/5 */

#define CRM_CFG_CLKOUT2_SEL1_SHIFT           (30) /* clock output2 selecction 1 */
#define CRM_CFG_CLKOUT2_SEL1_MASK            (3 << CRM_CFG_CLKOUT2_SEL1_SHIFT)
#  define CRM_CFG_CLKOUT2_SEL1_SCLK          (0 << CRM_CFG_CLKOUT2_SEL1_SHIFT) /* Output from SCLK */
#  define CRM_CFG_CLKOUT2_SEL1_2             (1 << CRM_CFG_CLKOUT2_SEL1_SHIFT) /* Output determine from CRM_MISC1 */
#  define CRM_CFG_CLKOUT2_SEL1_HEXT          (2 << CRM_CFG_CLKOUT2_SEL1_SHIFT) /* Output from HEXT */
#  define CRM_CFG_CLKOUT2_SEL1_PLL           (3 << CRM_CFG_CLKOUT2_SEL1_SHIFT) /* Output from PLL */

/* Clock interrupt register */

#define CRM_CLKINT_LICKSTBLF                 (1 << 0)  /* LICK stable flag */
#define CRM_CLKINT_LEXTSTBLF                 (1 << 1)  /* LEXT stable flag */
#define CRM_CLKINT_HICKSTBLF                 (1 << 2)  /* HICK stable flag */
#define CRM_CLKINT_HEXTSTBLF                 (1 << 3)  /* HEXT stable flag */
#define CRM_CLKINT_PLLSTBLF                  (1 << 4)  /* PLL stable flag */
#define CRM_CLKINT_CFDF                      (1 << 7)  /* Clock Failure Detection flag */
#define CRM_CLKINT_LICKSTBLIEN               (1 << 8)  /* LICK stable interrupt enable */
#define CRM_CLKINT_LEXTSTBLIEN               (1 << 9)  /* LEXT stable interrupt enable */
#define CRM_CLKINT_HICKSTBLIEN               (1 << 10) /* HICK stable interrupt enable */
#define CRM_CLKINT_HEXTSTBLIEN               (1 << 11) /* HEXT stable interrupt enable */
#define CRM_CLKINT_PLLSTBLIEN                (1 << 12) /* PLL stable interrupt enable */
#define CRM_CLKINT_LICKSTBLFC                (1 << 16) /* LICK stable flag clear */
#define CRM_CLKINT_LEXTSTBLFC                (1 << 17) /* LEXT stable flag clear */
#define CRM_CLKINT_HICKSTBLFC                (1 << 18) /* HICK stable flag clear */
#define CRM_CLKINT_HEXTSTBLFC                (1 << 19) /* HEXT stable flag clear */
#define CRM_CLKINT_PLLSTBLFC                 (1 << 20) /* PLL stable flag clear */
#define CRM_CLKINT_CFDFC                     (1 << 23) /* Clock failure detection interrupt clear */

/* AHB1 peripheral reset register */

#define CRM_AHBRST1_GPIOARST                (1 << 0)  /* IO port A reset */
#define CRM_AHBRST1_GPIOBRST                (1 << 1)  /* IO port B reset */
#define CRM_AHBRST1_GPIOCRST                (1 << 2)  /* IO port C reset */
#define CRM_AHBRST1_GPIODRST                (1 << 3)  /* IO port D reset */
#define CRM_AHBRST1_GPIOERST                (1 << 4)  /* IO port E reset */
#define CRM_AHBRST1_GPIOFRST                (1 << 5)  /* IO port F reset */
#define CRM_AHBRST1_GPIOGRST                (1 << 6)  /* IO port G reset */
#define CRM_AHBRST1_GPIOHRST                (1 << 7)  /* IO port H reset */
#define CRM_AHBRST1_CRCRST                  (1 << 12) /* CRC reset */
#define CRM_AHBRST1_EDMARST                 (1 << 21) /* EDMA reset */
#define CRM_AHBRST1_DMA1RST                 (1 << 22) /* DMA1 reset */
#define CRM_AHBRST1_DMA2RST                 (1 << 24) /* DMA2 reset */
#define CRM_AHBRST1_EMACRST                 (1 << 25) /* EMAC reset */
#define CRM_AHBRST1_OTGFS2RST               (1 << 29) /* OTGFS2 reset */

/* AHB2 peripheral reset register */

#define CRM_AHBRST2_DVPRST                  (1 << 0)  /* DVP reset */
#define CRM_AHBRST2_OTGFS1RST               (1 << 7)  /* OTGFS1 reset */
#define CRM_AHBRST2_SDIO1RST                (1 << 15) /* SDIO1 reset */

/* AHB3 peripheral reset register */

#define CRM_AHBRST3_XMCRST                  (1 << 0) /* XMC reset */
#define CRM_AHBRST3_QSPI1RST                (1 << 0) /* QSPI1 reset */
#define CRM_AHBRST3_QSPI2RST                (1 << 0) /* QSPI2 reset */
#define CRM_AHBRST3_SDIO2RST                (1 << 0) /* SDIO2 reset */

/* APB1 Peripheral reset register */

#define CRM_APB1RST_TMR2RST                 (1 << 0)  /* Timer2 reset */
#define CRM_APB1RST_TMR3RST                 (1 << 1)  /* Timer3 reset */
#define CRM_APB1RST_TMR4RST                 (1 << 2)  /* Timer4 reset */
#define CRM_APB1RST_TMR5RST                 (1 << 3)  /* Timer5 reset */
#define CRM_APB1RST_TMR6RST                 (1 << 4)  /* Timer6 reset */
#define CRM_APB1RST_TMR7RST                 (1 << 5)  /* Timer7 reset */
#define CRM_APB1RST_TMR12RST                (1 << 6)  /* Timer12 reset */
#define CRM_APB1RST_TMR13RST                (1 << 7)  /* Timer13 reset */
#define CRM_APB1RST_TMR14RST                (1 << 8)  /* Timer14 reset */
#define CRM_APB1RST_WWDTRST                 (1 << 11) /* Window watchdog reset */
#define CRM_APB1RST_SPI2RST                 (1 << 14) /* SPI2 reset */
#define CRM_APB1RST_SPI3RST                 (1 << 15) /* SPI3 reset */
#define CRM_APB1RST_USART2RST               (1 << 17) /* USART2 reset */
#define CRM_APB1RST_USART3RST               (1 << 18) /* USART3 reset */
#define CRM_APB1RST_UART4RST                (1 << 19) /* UART4 reset */
#define CRM_APB1RST_UART5RST                (1 << 20) /* UART5 reset */
#define CRM_APB1RST_I2C1RST                 (1 << 21) /* I2C1 reset */
#define CRM_APB1RST_I2C2RST                 (1 << 22) /* I2C2 reset */
#define CRM_APB1RST_I2C3RST                 (1 << 23) /* I2C3 reset */
#define CRM_APB1RST_CAN1RST                 (1 << 25) /* CAN1 reset */
#define CRM_APB1RST_CAN2RST                 (1 << 26) /* CAN2 reset */
#define CRM_APB1RST_PWCRST                  (1 << 28) /* Power interface reset */
#define CRM_APB1RST_DACRST                  (1 << 29) /* DAC interface reset */
#define CRM_APB1RST_UART7RST                (1 << 30) /* UART7 reset */
#define CRM_APB1RST_UART8RST                (1 << 31) /* UART8 reset */

/* APB2 Peripheral reset register */

#define CRM_APB2RST_TMR1RST                 (1 << 0)  /* TMR1 timer reset */
#define CRM_APB2RST_TMR8RST                 (1 << 1)  /* TMR8 timer reset */
#define CRM_APB2RST_USART1RST               (1 << 4)  /* USART1 reset */
#define CRM_APB2RST_USART6RST               (1 << 5)  /* USART6 reset */
#define CRM_APB2RST_ADCRST                  (1 << 8)  /* ADC interface reset */
#define CRM_APB2RST_SPI1RST                 (1 << 12) /* SPI1 reset */
#define CRM_APB2RST_SPI4RST                 (1 << 13) /* SPI4 reset */
#define CRM_APB2RST_SCFGRST                 (1 << 14) /* SCFG reset */
#define CRM_APB2RST_TMR9RST                 (1 << 16) /* Timer9 reset */
#define CRM_APB2RST_TMR10RST                (1 << 17) /* Timer10 reset */
#define CRM_APB2RST_TMR11RST                (1 << 18) /* Timer11 reset */
#define CRM_APB2RST_TMR20RST                (1 << 20) /* Timer20 reset */
#define CRM_APB2RST_ACCRST                  (1 << 29) /* ACC reset */

/* AHB1 Peripheral Clock enable register */

#define CRM_AHB1EN1_GPIOEN(n)               (1 << (n))
#define CRM_AHBEN1_GPIOAEN                  (1 << 0)  /* IO port A clock enable */
#define CRM_AHBEN1_GPIOBEN                  (1 << 1)  /* IO port B clock enable */
#define CRM_AHBEN1_GPIOCEN                  (1 << 2)  /* IO port C clock enable */
#define CRM_AHBEN1_GPIODEN                  (1 << 3)  /* IO port D clock enable */
#define CRM_AHBEN1_GPIOEEN                  (1 << 4)  /* IO port E clock enable */
#define CRM_AHBEN1_GPIOFEN                  (1 << 5)  /* IO port F clock enable */
#define CRM_AHBEN1_GPIOGEN                  (1 << 6)  /* IO port G clock enable */
#define CRM_AHBEN1_GPIOHEN                  (1 << 7)  /* IO port H clock enable */
#define CRM_AHBEN1_CRCEN                    (1 << 12) /* CRC clock enable */
#define CRM_AHBEN1_EDMAEN                   (1 << 21) /* EDMA clock enable */
#define CRM_AHBEN1_DMA1EN                   (1 << 22) /* DMA1 clock enable */
#define CRM_AHBEN1_DMA2EN                   (1 << 24) /* DMA2 clock enable */
#define CRM_AHBEN1_EMACEN                   (1 << 25) /* EMAC clock enable */
#define CRM_AHBEN1_EMACTXEN                 (1 << 26) /* EMAC TX clock enable */
#define CRM_AHBEN1_EMACRXEN                 (1 << 27) /* EMAC RX clock enable */
#define CRM_AHBEN1_EMACPTPEN                (1 << 28) /* EMAC PTP clock enable */
#define CRM_AHBEN1_OTGFS2EN                 (1 << 29) /* OTGFS2 clock enable */

/* AHB2 Peripheral Clock enable register */

