apache/nuttx/arch/arm/src/at32/hardware/at32f43xxx_rcc.h
#define CRM_AHBEN2_DVPEN                    (1 << 0)  /* DVP clock enable */
#define CRM_AHBEN2_OTGFS1EN                 (1 << 7)  /* OTGFS1 clock enable */
#define CRM_AHBEN2_SDIO1EN                  (1 << 15) /* SDIO1 clock enable */

/* AHB3 Peripheral Clock enable register */

#define CRM_AHBEN3_XMCEN                    (1 << 0)  /* XMC clock enable */
#define CRM_AHBEN3_QSPI1EN                  (1 << 1)  /* QSPI1 clock enable */
#define CRM_AHBEN3_QSPI2EN                  (1 << 14) /* QSPI2 clock enable */
#define CRM_AHBEN3_SDIO2EN                  (1 << 15) /* SDIO2 clock enable */

/* APB1 Peripheral Clock enable register */

#define CRM_APB1EN_TMR2EN                   (1 << 0)  /* Timer2 clock enable */
#define CRM_APB1EN_TMR3EN                   (1 << 1)  /* Timer3 clock enable */
#define CRM_APB1EN_TMR4EN                   (1 << 2)  /* Timer4 clock enable */
#define CRM_APB1EN_TMR5EN                   (1 << 3)  /* Timer5 clock enable */
#define CRM_APB1EN_TMR6EN                   (1 << 4)  /* Timer6 clock enable */
#define CRM_APB1EN_TMR7EN                   (1 << 5)  /* Timer7 clock enable */
#define CRM_APB1EN_TMR12EN                  (1 << 6)  /* Timer12 clock enable */
#define CRM_APB1EN_TMR13EN                  (1 << 7)  /* Timer13 clock enable */
#define CRM_APB1EN_TMR14EN                  (1 << 8)  /* Timer14 clock enable */
#define CRM_APB1EN_WWDTEN                   (1 << 11) /* Window watchdog clock enable */
#define CRM_APB1EN_SPI2EN                   (1 << 14) /* SPI2 clock enable */
#define CRM_APB1EN_SPI3EN                   (1 << 15) /* SPI3 clock enable */
#define CRM_APB1EN_USART2EN                 (1 << 17) /* USART2 clock enable */
#define CRM_APB1EN_USART3EN                 (1 << 18) /* USART3 clock enable */
#define CRM_APB1EN_UART4EN                  (1 << 19) /* UART4 clock enable */
#define CRM_APB1EN_UART5EN                  (1 << 20) /* UART5 clock enable */
#define CRM_APB1EN_I2C1EN                   (1 << 21) /* I2C1 clock enable */
#define CRM_APB1EN_I2C2EN                   (1 << 22) /* I2C2 clock enable */
#define CRM_APB1EN_I2C3EN                   (1 << 23) /* I2C3 clock enable */
#define CRM_APB1EN_CAN1EN                   (1 << 25) /* CAN1 clock enable */
#define CRM_APB1EN_CAN2EN                   (1 << 26) /* CAN2 clock enable */
#define CRM_APB1EN_PWCEN                    (1 << 28) /* Power interface clock enable */
#define CRM_APB1EN_DACEN                    (1 << 29) /* DAC interface clock enable */
#define CRM_APB1EN_UART7EN                  (1 << 30) /* UART7 clock enable */
#define CRM_APB1EN_UART8EN                  (1 << 31) /* UART8 clock enable */

/* APB2 Peripheral Clock enable register */

#define CRM_APB2EN_TMR1EN                   (1 << 0)  /* TMR1 timer clock enable */
#define CRM_APB2EN_TMR8EN                   (1 << 1)  /* TMR8 timer clock enable */
#define CRM_APB2EN_USART1EN                 (1 << 4)  /* USART1 clock enable */
#define CRM_APB2EN_USART6EN                 (1 << 5)  /* USART6 clock enable */
#define CRM_APB2EN_ADC1EN                   (1 << 8)  /* ADC1 interface clock enable */
#define CRM_APB2EN_ADC2EN                   (1 << 9)  /* ADC2 interface clock enable */
#define CRM_APB2EN_ADC3EN                   (1 << 10) /* ADC3 interface clock enable */
#define CRM_APB2EN_SPI1EN                   (1 << 12) /* SPI1 clock enable */
#define CRM_APB2EN_SPI4EN                   (1 << 13) /* SPI4 clock enable */
#define CRM_APB2EN_SCFGEN                   (1 << 14) /* SCFG clock enable */
#define CRM_APB2EN_TMR9EN                   (1 << 16) /* Timer9 clock enable */
#define CRM_APB2EN_TMR10EN                  (1 << 17) /* Timer10 clock enable */
#define CRM_APB2EN_TMR11EN                  (1 << 18) /* Timer11 clock enable */
#define CRM_APB2EN_TMR20EN                  (1 << 20) /* Timer20 clock enable */
#define CRM_APB2EN_ACCEN                    (1 << 29) /* ACC clock enable */

/* RCC AHB1 low power mode peripheral clock enable register */

#define CRM_AHBLPEN1_GPIOALPEN              (1 << 0)  /* IO port A clock enable during sleep mode */
#define CRM_AHBLPEN1_GPIOBLPEN              (1 << 1)  /* IO port B clock enable during sleep mode */
#define CRM_AHBLPEN1_GPIOCLPEN              (1 << 2)  /* IO port C clock enable during sleep mode */
#define CRM_AHBLPEN1_GPIODLPEN              (1 << 3)  /* IO port D clock enable during sleep mode */
#define CRM_AHBLPEN1_GPIOELPEN              (1 << 4)  /* IO port E clock enable during sleep mode */
#define CRM_AHBLPEN1_GPIOFLPEN              (1 << 5)  /* IO port F clock enable during sleep mode */
#define CRM_AHBLPEN1_GPIOGLPEN              (1 << 6)  /* IO port G clock enable during sleep mode */
#define CRM_AHBLPEN1_GPIOHLPEN              (1 << 7)  /* IO port H clock enable during sleep mode */
#define CRM_AHBLPEN1_CRCLPEN                (1 << 12) /* CRC clock enable during sleep mode */
#define CRM_AHBLPEN1_EDMALPEN               (1 << 21) /* EDMA clock enable during sleep mode */
#define CRM_AHBLPEN1_DMA1LPEN               (1 << 22) /* DMA1 clock enable during sleep mode */
#define CRM_AHBLPEN1_DMA2LPEN               (1 << 24) /* DMA2 clock enable during sleep mode */
#define CRM_AHBLPEN1_EMACLPEN               (1 << 25) /* EMAC clock enable during sleep mode */
#define CRM_AHBLPEN1_EMACTXLPEN             (1 << 26) /* EMAC TX clock enable during sleep mode */
#define CRM_AHBLPEN1_EMACRXLPEN             (1 << 27) /* EMAC RX clock enable during sleep mode */
#define CRM_AHBLPEN1_EMACPTPLPEN            (1 << 28) /* EMAC PTP clock enable during sleep mode */
#define CRM_AHBLPEN1_OTGFS2LPEN             (1 << 29) /* OTGFS2 clock enable during sleep mode */

/* RCC AHB2 low power mode peripheral clock enable register */

#define CRM_AHBLPEN2_DVPLPEN                (1 << 0)  /* DVP clock enable during sleep mode */
#define CRM_AHBLPEN2_OTGFS1LPEN             (1 << 7)  /* OTGFS1 clock enable during sleep mode */
#define CRM_AHBLPEN2_SDIO1LPEN              (1 << 15) /* SDIO1 clock enable during sleep mode */

/* RCC AHB3 low power mode Peripheral Clock enable register */

#define CRM_AHBLPEN3_XMCLPEN                (1 << 0)  /* XMC clock enable during sleep mode */
#define CRM_AHBLPEN3_QSPI1LPEN              (1 << 1)  /* QSPI1 clock enable during sleep mode */
#define CRM_AHBLPEN3_QSPI2LPEN              (1 << 14) /* QSPI2 clock enable during sleep mode */
#define CRM_AHBLPEN3_SDIO2LPEN              (1 << 15) /* SDIO2 clock enable during sleep mode */

