apache/nuttx/arch/arm/src/at32/hardware/at32f43xxx_rcc.h
/* RCC APB1 low power mode peripheral clock enable register */

#define CRM_APB1LPEN_TMR2LPEN               (1 << 0)  /* Timer2 clock enable during sleep mode */
#define CRM_APB1LPEN_TMR3LPEN               (1 << 1)  /* Timer3 clock enable during sleep mode */
#define CRM_APB1LPEN_TMR4LPEN               (1 << 2)  /* Timer4 clock enable during sleep mode */
#define CRM_APB1LPEN_TMR5LPEN               (1 << 3)  /* Timer5 clock enable during sleep mode */
#define CRM_APB1LPEN_TMR6LPEN               (1 << 4)  /* Timer6 clock enable during sleep mode */
#define CRM_APB1LPEN_TMR7LPEN               (1 << 5)  /* Timer7 clock enable during sleep mode */
#define CRM_APB1LPEN_TMR12LPEN              (1 << 6)  /* Timer12 clock enable during sleep mode */
#define CRM_APB1LPEN_TMR13LPEN              (1 << 7)  /* Timer13 clock enable during sleep mode */
#define CRM_APB1LPEN_TMR14LPEN              (1 << 8)  /* Timer14 clock enable during sleep mode */
#define CRM_APB1LPEN_WWDTLPEN               (1 << 11) /* Window watchdog clock enable during sleep mode */
#define CRM_APB1LPEN_SPI2LPEN               (1 << 14) /* SPI2 clock enable during sleep mode */
#define CRM_APB1LPEN_SPI3LPEN               (1 << 15) /* SPI3 clock enable during sleep mode */
#define CRM_APB1LPEN_USART2LPEN             (1 << 17) /* USART2 clock enable during sleep mode */
#define CRM_APB1LPEN_USART3LPEN             (1 << 18) /* USART3 clock enable during sleep mode */
#define CRM_APB1LPEN_UART4LPEN              (1 << 19) /* UART4 clock enable during sleep mode */
#define CRM_APB1LPEN_UART5LPEN              (1 << 20) /* UART5 clock enable during sleep mode */
#define CRM_APB1LPEN_I2C1LPEN               (1 << 21) /* I2C1 clock enable during sleep mode */
#define CRM_APB1LPEN_I2C2LPEN               (1 << 22) /* I2C2 clock enable during sleep mode */
#define CRM_APB1LPEN_I2C3LPEN               (1 << 23) /* I2C3 clock enable during sleep mode */
#define CRM_APB1LPEN_CAN1LPEN               (1 << 25) /* CAN1 clock enable during sleep mode */
#define CRM_APB1LPEN_CAN2LPEN               (1 << 26) /* CAN2 clock enable during sleep mode */
#define CRM_APB1LPEN_PWCLPEN                (1 << 28) /* Power interface clock enable during sleep mode */
#define CRM_APB1LPEN_DACLPEN                (1 << 29) /* DAC interface clock enable during sleep mode */
#define CRM_APB1LPEN_UART7LPEN              (1 << 30) /* UART7 clock enable during sleep mode */
#define CRM_APB1LPEN_UART8LPEN              (1 << 31) /* UART8 clock enable during sleep mode */

/* RCC APB2 low power mode peripheral clock enable register */

#define CRM_APB2LPEN_TMR1LPEN               (1 << 0)  /* TMR1 timer clock enable during sleep mode */
#define CRM_APB2LPEN_TMR8LPEN               (1 << 1)  /* TMR8 timer clock enable during sleep mode */
#define CRM_APB2LPEN_USART1LPEN             (1 << 4)  /* USART1 clock enable during sleep mode */
#define CRM_APB2LPEN_USART6LPEN             (1 << 5)  /* USART6 clock enable during sleep mode */
#define CRM_APB2LPEN_ADC1LPEN               (1 << 8)  /* ADC1 interface clock enable during sleep mode */
#define CRM_APB2LPEN_ADC2LPEN               (1 << 9)  /* ADC2 interface clock enable during sleep mode */
#define CRM_APB2LPEN_ADC3LPEN               (1 << 10) /* ADC3 interface clock enable during sleep mode */
#define CRM_APB2LPEN_SPI1LPEN               (1 << 12) /* SPI1 clock enable during sleep mode */
#define CRM_APB2LPEN_SPI4LPEN               (1 << 13) /* SPI4 clock enable during sleep mode */
#define CRM_APB2LPEN_SCFGLPEN               (1 << 14) /* SCFG clock enable during sleep mode */
#define CRM_APB2LPEN_TMR9LPEN               (1 << 16) /* Timer9 clock enable during sleep mode */
#define CRM_APB2LPEN_TMR10LPEN              (1 << 17) /* Timer10 clock enable during sleep mode */
#define CRM_APB2LPEN_TMR11LPEN              (1 << 18) /* Timer11 clock enable during sleep mode */
#define CRM_APB2LPEN_TMR20LPEN              (1 << 20) /* Timer20 clock enable during sleep mode */
#define CRM_APB2LPEN_ACCLPEN                (1 << 29) /* ACC clock enable during sleep mode */

/* Backup domain control register */

#define CRM_BPDC_LEXTEN                     (1 << 0) /* External low-speed oscillator enable */
#define CRM_BPDC_LEXTSTBL                   (1 << 1) /* External low-speed oscillator stable */
#define CRM_BPDC_LEXTBYPS

#define CRM_BPDC_ERTCSEL_SHIFT              (8) /* ERTC clock source selection */
#define CRM_BPDC_ERTCSEL_MASK               (3 << CRM_BPDC_ERTCSEL_SHIFT)
#  define CRM_BPDC_ERTCSEL_LEXT             (1 << CRM_BPDC_ERTCSEL_SHIFT) /* Select LEXT */
#  define CRM_BPDC_ERTCSEL_LICK             (2 << CRM_BPDC_ERTCSEL_SHIFT) /* Select LICK */
#  define CRM_BPDC_ERTCSEL_HEXT             (3 << CRM_BPDC_ERTCSEL_SHIFT) /* Select HEXT */

#define CRM_BPDC_ERTCEN                     (1 << 15) /* ERTC clock enable */
#define CRM_BPDC_BPDRST                     (1 << 16) /* Battery powered domain software reset */

/* Control/status register */

#define CRM_CTRLSTS_LICKEN                  (1 << 0)  /* LICK enable */
#define CRM_CTRLSTS_LICKSTBL                (1 << 1)  /* LICK stable */
#define CRM_CTRLSTS_RSTFC                   (1 << 24) /* Reset flag clear */
#define CRM_CTRLSTS_NRSTF                   (1 << 26) /* NRST reset flag */
#define CRM_CTRLSTS_PORRSTF                 (1 << 27) /* POR/LVR reset flag */
#define CRM_CTRLSTS_SWRSTF                  (1 << 28) /* Software reset flag */
#define CRM_CTRLSTS_WDTRSTF                 (1 << 29) /* WDT reset flag */
#define CRM_CTRLSTS_WWDTRSTF                (1 << 30) /* WWDT reset flag */
#define CRM_CTRLSTS_LPRSTF                  (1 << 31) /* Low-power reset flag */

/* Misc1 register */

#define CRM_MISC1_HICKCAL_KEY               (255 << 0)/* HICK calibration key */
#define CRM_MISC1_HICKDIV                   (1 << 12) /* HICK 6 divider selection */
#define CRM_MISC1_HICK_TO_USB               (1 << 13) /* USB 48MHz clock source select */
#define CRM_MISC1_HICK_TO_SCLK              (1 << 14) /* HICK as system clock frequency select */

