apache/nuttx/arch/arm/src/at32/hardware/at32f43xxx_rcc.h
#define CRM_MISC1_CLKOUT2_SEL2_SHIFT        (16) /* Clock output2 sel2 */
#define CRM_MISC1_CLKOUT2_SEL2_MASK         (15 << CRM_MISC1_CLKOUT2_SEL2_SHIFT) 
#  define CRM_MISC1_CLKOUT2_SEL2_USB        (0 << CRM_MISC1_CLKOUT2_SEL2_SHIFT) /* Select USB output */
#  define CRM_MISC1_CLKOUT2_SEL2_ADC        (1 << CRM_MISC1_CLKOUT2_SEL2_SHIFT) /* Select ADC output */
#  define CRM_MISC1_CLKOUT2_SEL2_HICK       (2 << CRM_MISC1_CLKOUT2_SEL2_SHIFT) /* Select HICK output */
#  define CRM_MISC1_CLKOUT2_SEL2_LICK       (3 << CRM_MISC1_CLKOUT2_SEL2_SHIFT) /* Select LICK output */
#  define CRM_MISC1_CLKOUT2_SEL2_LEXT       (4 << CRM_MISC1_CLKOUT2_SEL2_SHIFT) /* Select LEXT output */

#define CRM_MISC1_CLKOUT1DIV2_SHIFT         (24) /* Clock output1 division2 */
#define CRM_MISC1_CLKOUT1DIV2_MASK          (15 << CRM_MISC1_CLKOUT1DIV2_SHIFT)
#  define CRM_MISC1_CLKOUT1DIV2_NONE        (7 << CRM_MISC1_CLKOUT1DIV2_SHIFT)  /* Clock output1 division2 none */
#  define CRM_MISC1_CLKOUT1DIV2_2           (8 << CRM_MISC1_CLKOUT1DIV2_SHIFT)  /* Clock output1 division2 2 */
#  define CRM_MISC1_CLKOUT1DIV2_4           (9 << CRM_MISC1_CLKOUT1DIV2_SHIFT)  /* Clock output1 division2  4*/
#  define CRM_MISC1_CLKOUT1DIV2_8           (10 << CRM_MISC1_CLKOUT1DIV2_SHIFT) /* Clock output1 division2 8 */
#  define CRM_MISC1_CLKOUT1DIV2_16          (11 << CRM_MISC1_CLKOUT1DIV2_SHIFT) /* Clock output1 division2 16 */
#  define CRM_MISC1_CLKOUT1DIV2_64          (12 << CRM_MISC1_CLKOUT1DIV2_SHIFT) /* Clock output1 division2 64 */
#  define CRM_MISC1_CLKOUT1DIV2_128         (13 << CRM_MISC1_CLKOUT1DIV2_SHIFT) /* Clock output1 division2 128 */
#  define CRM_MISC1_CLKOUT1DIV2_256         (14 << CRM_MISC1_CLKOUT1DIV2_SHIFT) /* Clock output1 division2 256 */
#  define CRM_MISC1_CLKOUT1DIV2_512         (15 << CRM_MISC1_CLKOUT1DIV2_SHIFT) /* Clock output1 division2 512 */

#define CRM_MISC1_CLKOUT2DIV2_SHIFT         (28) /* Clock output2 division2 */
#define CRM_MISC1_CLKOUT2DIV2_MASK          (15 << CRM_MISC1_CLKOUT2DIV2_SHIFT)
#  define CRM_MISC1_CLKOUT2DIV2_NONE        (7 << CRM_MISC1_CLKOUT2DIV2_SHIFT)  /* Clock output2 division2 none */
#  define CRM_MISC1_CLKOUT2DIV2_2           (8 << CRM_MISC1_CLKOUT2DIV2_SHIFT)  /* Clock output2 division2 2 */
#  define CRM_MISC1_CLKOUT2DIV2_4           (9 << CRM_MISC1_CLKOUT2DIV2_SHIFT)  /* Clock output2 division2  4*/
#  define CRM_MISC1_CLKOUT2DIV2_8           (10 << CRM_MISC1_CLKOUT2DIV2_SHIFT) /* Clock output2 division2 8 */
#  define CRM_MISC1_CLKOUT2DIV2_16          (11 << CRM_MISC1_CLKOUT2DIV2_SHIFT) /* Clock output2 division2 16 */
#  define CRM_MISC1_CLKOUT2DIV2_64          (12 << CRM_MISC1_CLKOUT2DIV2_SHIFT) /* Clock output2 division2 64 */
#  define CRM_MISC1_CLKOUT2DIV2_128         (13 << CRM_MISC1_CLKOUT2DIV2_SHIFT) /* Clock output2 division2 128 */
#  define CRM_MISC1_CLKOUT2DIV2_256         (14 << CRM_MISC1_CLKOUT2DIV2_SHIFT) /* Clock output2 division2 256 */
#  define CRM_MISC1_CLKOUT2DIV2_512         (15 << CRM_MISC1_CLKOUT2DIV2_SHIFT) /* Clock output2 division2 512 */

/* Misc1 register */

#define CRM_MISC2_AUTO_STEP_EN_SHIFT        (4) /* auto step system clock switch enable */
#define CRM_MISC2_AUTO_STEP_EN_MASK         (3 << CRM_MISC2_AUTO_STEP_EN_SHIFT)
#  define CRM_MISC2_AUTO_STEP_EN_DISABLE    (0 << CRM_MISC2_AUTO_STEP_EN_SHIFT) /* disanle */
#  define CRM_MISC2_AUTO_STEP_EN_ENABLE     (3 << CRM_MISC2_AUTO_STEP_EN_SHIFT) /* enable */

#define CRM_MISC2_CLK1_TO_TMR               (1 << 8) /* CLKOUT1 internal connect to timer 10 channel 1 */
#define CRM_MISC2_EMAC_PPS_SEL              (1 << 9) /* Ethernet pulse width select */

#define CRM_MISC2_USBDIV_SHIFT              (12) /* USB division */
#define CRM_MISC2_USBDIV_MASK               (15 << CRM_MISC2_USBDIV_SHIFT)
#  define CRM_MISC2_USBDIV_1P5              (0 << CRM_MISC2_USBDIV_SHIFT)  /* Div 1.5 */
#  define CRM_MISC2_USBDIV_1P0              (1 << CRM_MISC2_USBDIV_SHIFT)  /* Div 1 */
#  define CRM_MISC2_USBDIV_2P5              (2 << CRM_MISC2_USBDIV_SHIFT)  /* Div 2.5 */
#  define CRM_MISC2_USBDIV_2P0              (3 << CRM_MISC2_USBDIV_SHIFT)  /* Div 2 */
#  define CRM_MISC2_USBDIV_3P5              (4 << CRM_MISC2_USBDIV_SHIFT)  /* Div 3.5 */
#  define CRM_MISC2_USBDIV_3P0              (5 << CRM_MISC2_USBDIV_SHIFT)  /* Div 3 */
#  define CRM_MISC2_USBDIV_4P5              (6 << CRM_MISC2_USBDIV_SHIFT)  /* Div 4.5 */
#  define CRM_MISC2_USBDIV_4P0              (7 << CRM_MISC2_USBDIV_SHIFT)  /* Div 4 */
#  define CRM_MISC2_USBDIV_5P5              (8 << CRM_MISC2_USBDIV_SHIFT)  /* Div 5.5 */
#  define CRM_MISC2_USBDIV_5P0              (9 << CRM_MISC2_USBDIV_SHIFT)  /* Div 5 */
#  define CRM_MISC2_USBDIV_6P5              (10 << CRM_MISC2_USBDIV_SHIFT) /* Div 6.5 */
#  define CRM_MISC2_USBDIV_6P0              (11 << CRM_MISC2_USBDIV_SHIFT) /* Div 6 */
#  define CRM_MISC2_USBDIV_7P0              (12 << CRM_MISC2_USBDIV_SHIFT) /* Div 7 */

#endif /* __ARCH_ARM_SRC_AT32_HARDWARE_AT32F43XXX_RCC_H */
